These are the logs in our case. Some identifying information has been redacted
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_backup_selection.production1 must be replaced
-/+ resource "aws_backup_selection" "production1" {
        iam_role_arn = "arn:aws:iam:REDACTED:role/service-role/AWSBackupDefaultServiceRole"
      ~ id           = "f513f5ae-03a1-4a4c-940d-2d61f17217c2" -> (known after apply)
        name         = "production1"
        plan_id      = "2a03b079-009c-4809-9f25-5e7ebe5592b4"
      ~ resources    = [
          - "arn:aws:rds:ap-southeast-2REDACTED:db:production1",
        ] -> (known after apply) # forces replacement
    }

  # aws_db_instance.production1 must be replaced
-/+ resource "aws_db_instance" "production1" {
      ~ address                               = "REDACTED_RDS_LINK" -> (known after apply)
        allocated_storage                     = 1100
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:ap-southeast-2REDACTED:db:production1" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "ap-southeast-2a" -> "ap-southeast-2c" # forces replacement
        backup_retention_period               = 35
        backup_window                         = "14:00-14:30"
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "default-vpc-b903e9dd"
        delete_automated_backups              = true
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "REDACTED_RDS_LINK:5432" -> (known after apply)
        engine                                = "postgres"
        engine_version                        = "9.6.18"
      ~ hosted_zone_id                        = "Z32T0VRHXEXS0V" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "production1" -> (known after apply)
        identifier                            = "production1"
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.m4.xlarge"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ latest_restorable_time                = "2021-01-13T02:44:36Z" -> (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
        maintenance_window                    = "sun:16:00-sun:16:30"
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 60
      ~ monitoring_role_arn                   = "arn:aws:iam:REDACTED:role/rds-monitoring-role" -> (known after apply)
        multi_az                              = true
      + name                                  = (known after apply)
      ~ option_group_name                     = "default:postgres-9-6" -> (known after apply)
        parameter_group_name                  = "production1"
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
        port                                  = 5432
        publicly_accessible                   = false
      ~ replicas                              = [
          - "production1-replica",
        ] -> (known after apply)
      ~ resource_id                           = "db-YQCXDETVH5AHNOTL6Y4XCW42VI" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
        storage_type                          = "gp2"
        tags                                  = {
            "workload-type" = "production"
        }
      + timezone                              = (known after apply)
        username                              = "production1"
        vpc_security_group_ids                = [
            "sg-008d8464",
        ]

      - timeouts {}
    }

  # aws_route53_record._dmarc-REDACTED-COMPANY-NAME-com-TXT will be updated in-place
~ resource "aws_route53_record" "_dmarc-REDACTED-COMPANY-NAME-com-TXT" {
        allow_overwrite = false
        fqdn            = "_dmarc.REDACTED-COMPANY-NAME.com"
        id              = "Z3AI2I4US71WBA__dmarc.REDACTED-COMPANY-NAME.com_TXT"
        name            = "_dmarc.REDACTED-COMPANY-NAME.com"
      ~ records         = [
          + "v=DMARC1; p=quarantine; pct=5; sp=none; rua=mailto:platform@REDACTED-COMPANY-NAME.com",
          - "v=DMARC1; p=reject; sp=none; rua=mailto:REDACTED_EMAIL_ADDRESS.com",
        ]
        ttl             = 3600
        type            = "TXT"
        zone_id         = "Z3AI2I4US71WBA"
    }

```